In [3]:
import pandas as pd

df = pd.read_excel('C:\\Setup_code\\tempX.xlsx')
df.head()

           Employee       Date       Part Number Op Number SO Number
0   HICKEY, MICHAEL 2023-07-24          VSM-6277      050A     19547
1  MCCABE, CLIFFORD 2023-07-24        71693-1216       020    20253N
2     LANTZ, TRAVIS 2023-07-24    A00017A27-1618       020    19787N
3       YOUNG, COBY 2023-07-24    C00288A58-1299       030     20266
4    SHEPARD, ALLEN 2023-07-24  52128682002-2459       032     20063